Tekla.Structures.Geometry3d.FacetedBrep.#ctor(Tekla.Structures.Geometry3d.Vector[],System.Int32[][],System.Collections.Generic.IDictionary{System.Int32,System.Int32[][]})
Initializes a new instance of the Tekla.Structures.Geometry3d.FacetedBrep class.
@param vertices The vertices.
@param outerWires The outer wires.
@param innerWires The inner wires.

Tekla.Structures.Geometry3d.FacetedBrep.CheckForTwoManifold
Gets a value indicating whether this instance is 2-manifold.
@return true if this instance is 2-manifold; otherwise false.

Tekla.Structures.Geometry3d.FacetedBrep.GetInnerFace(System.Int32)
Gets the inner face at the specified index.
@param faceIndex index of the face.
@return The array of vertex indexes for the inner face.

Tekla.Structures.Geometry3d.FacetedBrep.GetInnerFaceCount(System.Int32)
Gets the inner face count of the outer face at the specified index.
@param faceIndex index of the face.
@return The count of inner faces for the outer face.

Tekla.Structures.Geometry3d.FacetedBrep.GetOuterFace(System.Int32)
Gets the outer face at the specified index.
@param faceIndex index of the face.
@return The array of vertex indexes for the outer face.